# bug - არის პრობლემა რომელიც კოდირების დროს გვხვდება Error
# debugging - არის როდესაც კომპიუტერი ეძებს შეცდომას Error-ს და აჩერებს, და როდესაც პროგრამის მუშაობა ჩერდება ჩვენ ვეძებთ პრობლემის გამომწვევ კოდს
# ტექსტური მნიშვნელობა არის String. ტექსტური მნიშვნელობა რომ მივიღოთ ტექსტს უნდა მივანიჭოთ ბრჭყალები
# რიცხვითი მნიშვნელობა არის Integer. რიცხვითი მნიშვნელობა რომ მივანიჭოთ ციფრს არაფერი არ გვჭირდება ბრძანების გარდა მაგ: print(15) num = 14
# კომენტარის კოდში გამოყენებით კომპიუტერი ვერ ნახულობს თუ რა დავწერეთ ჩვენ ეს მარტო შეიძლება ნახოს ადამიანებმა. კომანტარს ჩვენ ვიყენებთ რაღაცეების დასამახსოვრებლად

# +

print(312 + 252)
print(4142 + 141)
print(1231 + 3244)
print(563456 + 424)
print(86 + 978)
print(867 + 9786)
print(755767 + 8768)
print(799 + 75567)
print(8575 + 5675)
print(7557+977)
print(3646 + 4124)
print(424 + 353)
print(535 + 646)
print(564 + 7656)
print(67 + 5675)

# -

print(453 - 546)
print(563 - 647) 
print(567 - 867)
print(75 - 75)
print(757 - 647)
print(5675 - 568)
print(255 - 353)
print(6463 - 424)
print(646 - 967)
print(688 - 868)
print(9765 - 8678)
print(855 - 987)
print(7575 - 585)
print(9897 - 757)
print(5363 - 6581)

# *

print(3453 * 25322)
print(75 * 646)
print(57 * 756)
print(464 * 56)
print(3553 * 6464) 
print(546 * 45)
print(64 * 64)
print(76 * 65)
print(645 * 5453)
print(6464 * 4554)
print(876 * 67)
print(646 * 75)
print(757 * 756)
print(65 * 43)
print(756 * 56)

# /

print(645 / 523)
print(2 / 7856)
print(423 / 5)
print(876 / 756)
print(9878 / 6757)
print(768 / 876)
print(756 / 8765)
print(75 / 75)
print(978 / 7578)
print(867 / 876)
print(324 / 8678)
print(9642 / 8686)
print(768 / 645)
print(765 / 978)
print(897 / 987)