
nums = [1,2,3,4,5,6]
# ვქმნით სიას და შეგვაქ 6 მნიშვნელობა
res = nums[::-1]
# შემდეგ ეს სია გადაგვაქს სხვა სიაში სადაც ათვლა იწყება ბოლო ინდექსიდან და ჩადის 0 ინდექზე ან -6 ინდექზე
print(res[2])
# შემდეგ გამოგვაქს თუ რომელი მნიშვნელობა დგას მეორე სიაში მეორე ინდექსზე

# პასუხი არის 4

# task 2

name = input("enter a string: ")
# მომხმარებელს შეაქვს სახელი 
name1 = list(name)
# მომხმარებლის სახელი გადაიქცევა სიად
print(name1[-1])
# საბოლოოდ მომხმარებლის სახელის ბოლო ასო გამოდის

# task 3

names = ["gio", "mari", "luka", "saba", "levani"]
# შეგვაქვს 5 სახელი სიაში
names[1:-1]
# შემდეგ პირველი ინდექსიდან ბოლო ინდექსამდე და გამოდის შუა სამი მნიშვნელობა

# task 4

list1 = [1,2,3,4.45, "toko", True, False, 5.6, 1.6, "gio"]
# ვქმნით სიას რომელსაც აქვს 10 მნიშვნელობა სხვადასხვა სახის
print(list1[10:4:-1])
# შემდეგ ბოლო ინდექსიდან მეოთხე ინდექსამდე -ინდექსით ჩავდივართ და გამოგვაქვს ბოლო 5 მნიშვნელობა

# task 5

text = input("enter a text: ")
# ვქმნით ცვლადს სადაც მომხმარებელს ვაძლევთ საშვალებას შეიტანოს ტექსი შემდეგ ამ ტექსტის ინდექსი იწყება ბოლოდან ანუ ბოლო ასოდან და ჩამოდის პირველ ასომდე  
print(text[::-1])
# ამის შემდეგ ჩვენ გამოგვაქვს ეს ტექსტი