# task 1

# answer is 4

list1 = [2,8,4,6]
#ვქმნით სიას და შეგვაქ 4 მნიშვნელობა

list1.remove(2)
#სიას ვაშორებთ მნიშვნელობა 2-ს

print(len(list1) + list1.count(6))
#შემდეგ გამოგვაქვს შეცვლის მერე სიის მნიშვნელობების რაოდენობას დამატებული 6-ის რაოდენობაამ სიაში ამ შემთხვევაში არის 1

# task 2

nums = [2,4,8,9,5]
# ვქმნით სიას რომელშიც შეგვაქვს 5 მნიშვნელობა

nums.insert(1, 3)
# პირველ ინდექსზე ვამატებთ რიცხვ სამს

nums.remove(9)
# შემდეგ სიიდან ამოგვაქვს რიცხვი 9 

nums.insert(0, nums.count(8))
# შემდეგ სიაში 0 ინდექსზე ვამატებთ სიაში მყოფი რვის რაოდენობას ამ შემთხვევაში 1-ს

print(nums[3])
# შემდეგ გამოგვაქვს მესამე ინდექსზე მყოფი მნიშვნელობა ამ სიაში პასუხი არის 4

# task 3

user = input("enter a text: ")
# მომხმარებელს შემოაქვს ტექსტი

queue = ['John', 'Amy', 'Bob', 'Adam']
# ვქმნით სიას

queue.append(user)
# ამ სიაში ვამატებთ მომხმარებლის მიერ შეტანილ ტექსტს append-ით

print(queue)
# გამოგვაქვს ბოლო სია